---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecSwitchIdParam
source: html/f0fdc746-74bf-1eeb-e3c8-59a99b949c7c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecSwitchIdParam Property

"Switch ID"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecSwitchIdParam { get; }
```